# Напишите программу, которая принимает на вход 2 числа.
# Получите значение N, для пустого списка, заполните числами в диапзоне [-N, N].
# Найдите произведение элементов на указанных позициях(не индексах)
N = int(input("Введите число  N: "))
Pos1 = int(input("Первая позиция: "))
Pos2 = int(input("Вторая позиция: "))
listN = []
if N < 0:
    N = -1 * N
for i in range(N * 2 + 1):
    listN.append(N * (-1) + i)
print(listN)

if 1 > Pos1 or Pos1 > N * 2 + 1 or 1 > Pos2 or Pos2 > N * 2 + 1:
    print("Одна из позиций отсутствует в данном списке")
else:
    mult = listN[Pos1 - 1] * listN[Pos2 - 1]
    print(mult)
    
